#pragma once
#include "GF8.h"

class Sbox {
public:
	GF8 gf8; //gf(2^8)의 객체
	int getSubstitute(char input);//sbox한 결가
	int getInverse(char input);//inverse sbox를 한 결과를 리턴
private:
	/*암호화를 위한 상수값*/
	int matrix[8][8] = {
		{1,0,0,0,1,1,1,1},
		{1,1,0,0,0,1,1,1},
		{1,1,1,0,0,0,1,1},
		{1,1,1,1,0,0,0,1},
		{1,1,1,1,1,0,0,0},
		{0,1,1,1,1,1,0,0},
		{0,0,1,1,1,1,1,0},
		{0,0,0,1,1,1,1,1}
	};
	int addRow[8] = { 1,1,0,0,0,1,1,0 };

	/*복호화를 위한 상수값*/
	int inverseMatrix[8][8] = {
		{0,0,1,0,0,1,0,1},
		{1,0,0,1,0,0,1,0},
		{0,1,0,0,1,0,0,1},
		{1,0,1,0,0,1,0,0},
		{0,1,0,1,0,0,1,0},
		{0,0,1,0,1,0,0,1},
		{1,0,0,1,0,1,0,0},
		{0,1,0,0,1,0,1,0}
	};
	int inverseRow[8] = { 1,0,1,0,0,0,0,0 };
};